Repository: cymise/Karabiner-Elements
Catalog: src/apps/SettingsWindow/Localizable.xcstrings
Source language: en
Languages: ko

source: (Default value is 50)
ko: (기본값: 50)

source: (Default value is 500)
ko: (기본값: 500)

source: (Default value is 1000)
ko: (기본값: 1000)

source: (Default: %@
ko: (기본: %@

source: (Default: %@)
ko: (기본: %@)

source: (Default: %lld)
ko: (기본: %lld)

source: % (Default value is 100)
ko: % (기본값: 100)

source: 1. Open Home folder in Finder
ko: 1. Finder에서 홈 폴더를 여십시오.

source: 1. Press the following button to deactivate driver. (The administrator password will be required.)
ko: 1. 드라이버를 비활성화하려면 아래의 버튼을 누르세요. (관리자 비밀번호가 필요합니다.)

source: 2. Press Command + Shift + . (period) to show hidden files
ko: 2. Command + Shift + .(마침표) 를 눌러 숨김 파일을 봅니다.

source: 2. Restart macOS.
ko: 2. macOS를 재시동하세요.

source: 3. After restarting, the driver will be automatically loaded, and the Driver Extensions settings will appear.
ko: 3. 재시동 후, 드라이버는 자동으로 로드되고 드라이버 확장 프로그램 설정이 나타납니다.

source: 3. Find .local folder, and choose "Get Info" from Menu
ko: 3. .local 폴더를 찾고, 메뉴에서 “정보 가져오기” 를 선택합니다.

source: 3. Press the following button to activate driver.
ko: 3. 드라이버를 활성화하려면 아래의 버튼을 누르세요.

source: 4. "System Extension Blocked" alert is shown.
ko: 4. “시스템 확장 프로그램 차단됨” 경고가 나타납니다.

source: 5. Open Privacy & Security System Settings and press the allow button.
ko: 5. 시스템 설정의 개인정보 보호 및 보안 설정을 열고, 허용 버튼을 누릅니다.

source: Action
ko: 액션

source: Activate driver
ko: 드라이버 활성화

source: Activating ...
ko: 활성화 중…

source: Activation was failed. (error: %d)
ko: 활성화에 실패했습니다. (오류: %d)

source: Add divider
ko: 구분선 추가

source: Add item
ko: 항목 추가

source: Add predefined rule
ko: 사전 정의된 규칙 추가

source: Add your own rule
ko: 나만의 규칙 추가

source: Add your own rule using JavaScript
ko: JavaScript로 나만의 규칙 추가

source: Advanced
ko: 고급

source: All Karabiner-Elements modifications are temporarily disabled by EventViewer.
ko: 모든 Karabiner-Elements의 변형들이 EventViewer에 의해 일시적으로 중단되었습니다.

source: ANSI (North America, most of Asia and others)
ko: ANSI (북미, 대부분의 아시아 지역 및 그 외)

source: App icon
ko: 앱 아이콘

source: Apple pointing devices are not supported
ko: Apple 포인팅 장치는 지원되지 않습니다.

source: Ask for confirmation when quitting (Default: on)
ko: 종료 시 확인 (기본값: 켜짐)

source: Cancel
ko: 취소

source: Changes saved in the external editor are automatically reflected while this window is open.
ko: 이 창이 열려있는 동안, 외부 편집기로 저장된 변경 사항은 자동으로 반영됩니다.

source: Check for beta updates
ko: 베타 업데이트 확인

source: Check for updates
ko: 업데이트 확인

source: Check for updates on startup (Default: on)
ko: 시작 시 업데이트를 확인합니다 (기본값: 켜짐)

source: Choose editor
ko: 편집기 선택

source: Complex Modifications
ko: 복합 변형

source: Content is too large to edit. Please edit karabiner.json directly with your favorite editor.
ko: 내용이 편집하기에는 너무 큽니다. 선호하는 편집기로 karabiner.json을 편집하십시오.

source: Copy the current configuration to the system default configuration
ko: 현재 설정을 시스템 기본 설정으로 복사

source: Copy to pasteboard
ko: 클립보드에 복사

source: Current time: %@
ko: 현재 시각: %@

source: Cursor speed:
ko: 커서 속도:

source: Deactivate driver
ko: 드라이버 비활성화

source: Deactivating ...
ko: 비활성화 중…

source: Deactivation was failed. (error: %d)
ko: 비활성화에 실패했습니다. (오류: %d)

source: deadzone:
ko: 데드존:

source: Delay to grab device
ko: 장치 인식 지연

source: Device Address: %@
ko: 장치 주소: %@

source: Devices
ko: 장치

source: Disable the built-in keyboard while this device is connected
ko: 이 장치가 연결되어 있는 동안 내장 키보드 끔

source: disabled
ko: 꺼짐

source: Discard mouse horizontal wheel
ko: 마우스 수평 휠 무시

source: Discard mouse vertical wheel
ko: 마우스 수직 휠 무시

source: Discard mouse X
ko: 마우스 X축 무시

source: Discard mouse Y
ko: 마우스 Y축 무시

source: Driver was successfully activated.
ko: 드라이버가 성공적으로 활성화되었습니다.

source: Driver was successfully deactivated.
ko: 드라이버가 성공적으로 비활성화되었습니다.

source: Duplicate
ko: 복제

source: Edit
ko: 편집

source: Enable
ko: 켜기

source: Enable All
ko: 모두 켜기

source: Enable Karabiner Notification Window (Default: on)
ko: Karabiner 알림 창 켜기 (기본값: 켜짐)

source: Enable Multitouch Extension (Default: off)
ko: 멀티터치 확장 켜기 (기본값:꺼짐)

source: Enable unsafe configuration (Default: off)
ko: 위험한 설정 켜기 (기본값: 꺼짐)

source: Expert
ko: 전문가용

source: Expert mode
ko: 전문가 모드

source: Export & Import
ko: 내보내기 및 불러오기

source: Extra tool: Multitouch Extension
ko: 추가 도구: 멀티터치 확장

source: Filter useless events from specific devices (Default: on)
ko: 특정 장치들의 불필요한 이벤트 무시 (기본값: 켜짐)

source: Flip mouse horizontal wheel
ko: 마우스 수평 휠 반전

source: Flip mouse vertical wheel
ko: 마우스 수직 휠 반전

source: Flip mouse X
ko: 마우스 X축 반전

source: Flip mouse Y
ko: 마우스 Y축 반전

source: For export
ko: 내보내기용

source: Function Keys
ko: 기능 키

source: How to check the permission
ko: 권한 확인 방법

source: How to reactivate driver:
ko: 드라이버 재활성화 방법:

source: How to reinstall driver:
ko: 드라이버 재설치 방법:

source: icon
ko: 아이콘을 드래그하기

source: If macOS failed to load the driver in the early stage, the allow button might be not shown on Privacy & Security System Settings.
ko: 만약 macOS가 시작 시 드라이버 로딩에 실패하면, 허용 버튼이 시스템 설정의 개인정보 보호 및 보안 설정에 나타나지 않을 수 있습니다.

source: If macOS failed to load the driver in the early stage, the Driver Extensions might be not shown on Login Items & Extensions System Settings.
ko: 만약 macOS가 시작 시 드라이버 로딩에 실패하면, 허용 버튼이 시스템 설정의 로그인 항목 및 확장 프로그램 설정에 나타나지 않을 수 있습니다.

source: If the Allow button is not displayed on Privacy & Security.
ko: 만약 허용 버튼이 개인정보 보호 및 보안 설정에서 보이지 않는 경우.

source: If the Driver Extensions is not displayed on Extensions.
ko: 만약 드라이버 확장 프로그램이 개인정보 보호 및 보안 설정에서 보이지 않는 경우.

source: If the message remains visible, third-party security software may be blocking communication with Karabiner-VirtualHIDDevice-Daemon.
ko: 이 메시지가 지속된다면, 서드파티 보안 소프트웨어가 Karabiner-VirtualHIDDevice-Daemon과의 통신을 차단하고 있을 수 있습니다.

source: If the services do not start within 20 seconds, please disable the services and then enable them again.
ko: 만약 서비스들이 20초 내에 시작되지 않는다면, 서비스들을 끄고 다시 켜십시오.

source: If this message still appears after restarting macOS.
ko: 만약 이 메시지가 macOS 재시작 후에도 나타나는 경우.

source: If you continue to get this message after restarting macOS, try deactivating the virtual driver once by the following steps.
ko: 만약 macOS를 재시작한 후에도 메시지가 지속되는 경우, 아래 단계들을 따라 가상 드라이버를 비활성화 해보십시오.

source: If your keyboard supports hardware macros and sends multiple keys at once, and you notice that modifier key order is changing, try turning this setting off.
ko: 만약 연결된 키보드가 하드웨어 매크로를 이용하여 키들을 동시 입력하는 경우, 모디파이어 키 순서가 바뀌는 현상이 발생한다면 이 설정을 꺼보십시오.

source: Ignore vendor events
ko: 제조사 이벤트 무시

source: Import
ko: 불러오기

source: Import file from %@
ko: %@ 로부터 파일 불러오기

source: Imported at %@
ko: %@ 로부터 파일을 불러옴

source: In such cases, reactivating the driver may increase the chances of it loading successfully.
ko: 그러한 상황들에서, 드라이버를 다시 활성화하는 것이 도움이 될 수 있습니다.

source: In this case, you need to reinstall the driver in order for the button to appear.
ko: 그러한 상황에서, 버튼을 나타나게 하기 위하여 드라이버의 재설치가 필요합니다.

source: Indicate sticky modifier keys state (Default: on)
ko: 모디파이어 키 고정 상태 표시 (기본값: 켜짐)

source: Invalid formula
ko: 올바르지 않은 조합

source: ISO (Europe, Latin America, Middle-East and others)
ko: ISO (유럽, 라틴 아메리카, 중동 및 기타)

source: It is recommended to enable "Ignore vendor events" for non-Apple devices
ko: Apple이 제조하지 않는 장치들에 대하여 “제조사 이벤트 무시”를 켜는 것이 권장됩니다.

source: It looks like the file was edited manually and now contains invalid JSON.
ko: 이 파일이 수동으로 수정되었으며, 유효하지 않은 JSON을 포함하고 있습니다.

source: It takes a few seconds for changes to the application icon to take effect. And to update the Dock icon, you need to close and reopen the application.
ko: 앱 아이콘을 변경하는 데에는 시간이 소요됩니다. Dock 아이콘은 프로그램이 재시작된 후에 업데이트됩니다.

source: JIS (Japanese)
ko: JIS (일본어)

source: Karabiner Notification Window
ko: Karabiner 알림 창

source: Karabiner-Core-Service requires Input Monitoring permission. Please allow them on Privacy & Security System Settings.
ko: Karabiner-Core-Service는 입력 모니터링 권한을 요구합니다. 시스템 설정의 개인정보 보호 및 보안 설정에서 권한을 허용하십시오.

source: Karabiner-Elements Settings
ko: Karabiner-Elements 설정

source: Karabiner-Elements version %@
ko: Karabiner-Elements 버전 %@

source: karabiner.json couldn't be loaded due to a parse error
ko: 파싱 오류로 인하여 karabiner.json 파일을 불러올 수 없습니다.

source: Keyboard Type
ko: 키보드 종류

source: Keyboard type:
ko: 키보드 종류:

source: Launch uninstaller
ko: 삭제 프로그램 실행

source: Loading...
ko: 로딩…

source: Log
ko: 로그

source: macOS log messages
ko: macOS 로그 메시지

source: macOS restart required
ko: macOS 재시작 필요함

source: Manipulate caps lock LED
ko: Caps Lock LED 조작

source: Menu bar
ko: 메뉴 바

source: milliseconds (Default value is 1000)
ko: 밀리초 (기본 값: 1000)

source: Misc
ko: 기타 기능들

source: Modify events
ko: 이벤트 변형

source: Mouse Flags
ko: 마우스 플래그

source: Mouse key
ko: 마우스 키

source: Move item to bottom
ko: 항목을 가장 아래로 이동

source: Move item to top
ko: 항목을 가장 위로 이동

source: Multiplier
ko: 배수

# must be between %lld and %lld
source: must be between %1$lld and %2$lld
ko: 반드시 %1$lld 와 %2$lld 사이 값이어야 함

source: Note: You can change it later from the Virtual Keyboard settings.
ko: 참고: 나중에 가상 키보드 설정에서 변경할 수 있습니다.

source: Off
ko: 꺼짐

source: On
ko: 켜짐

source: Open config folder
ko: 설정 폴더 열기

source: Open game pad settings
ko: 게임 패드 설정 열기

source: Open GitHub (source code)
ko: GitHub (소스 코드) 열기

source: Open Home folder...
ko: 홈 폴더 열기…

source: Open Login Items & Extensions Settings...
ko: 로그인 항목 및 확장 프로그램 설정 열기

source: Open mouse settings
ko: 마우스 설정 열기

source: Open official website
ko: 공식 웹사이트 열기

source: Open Privacy & Security System Settings...
ko: 개인정보 보호 및 보안 설정 열기

source: Open System Settings > Function Keys...
ko: 시스템 설정 > 기능 키 열기…

source: Open System Settings > General > Login Items & Extensions
ko: 시스템 설정 > 일반 > 로그인 항목 및 확장 프로그램 설정 열기

source: Open System Settings...
ko: 시스템 설정 열기…

source: Options
ko: 설정

source: Others
ko: 기타

source: Parameters
ko: 파라미터

source: Please allow ".Karabiner-VirtualHIDDevice-Manager" on Driver Extensions.
ko: 드라이버 확장 프로그램 설정에서 ".Karabiner-VirtualHIDDevice-Manager”를 허용하십시오.

source: Please allow ".Karabiner-VirtualHIDDevice-Manager" on Privacy & Security System Settings.
ko: 개인정보 보호 및 보안 설정에서 ".Karabiner-VirtualHIDDevice-Manager”를 허용하십시오.

source: Please allow Karabiner apps to monitor input events
ko: Karabiner 구성 요소들이 입력을 모니터링 할 수 있도록 허용하십시오.

source: Please allow Karabiner-VirtualHIDDevice-Manager system software
ko: Karabiner-VirtualHIDDevice-Manager 시스템 소프트웨어를 허용하십시오.

source: Please enable the following items from System Settings > General > Login Items & Extensions.
ko: 시스템 설정 > 일반 > 로그인 항목 및 확장 프로그램에서 항목들을 켜십시오.

source: Please grant permission for a Driver Extension
ko: 드라이버 확장 프로그램을 위한 권한을 부여하십시오.

source: Please restart macOS to upgrade the driver.
ko: 드라이버를 업그레이드하기 위하여 macOS를 재시작하십시오.

source: Please select the keyboard type you'd like to use
ko: 사용하고자 하는 키보드 종류를 선택하십시오.

source: Position
ko: 위치

source: Profile name
ko: 프로필 이름

source: Profile name:
ko: 프로필 이름:

source: Profiles
ko: 프로필

source: Quit Karabiner-Elements
ko: Karabiner-Elements 종료

source: Quit, Restart
ko: 종료, 재시작

source: Refresh
ko: 새로고침

source: Remove settings for %llu devices
ko: %llu개 장치들에 대한 설정 제거하기

source: Remove the system default configuration
ko: 시스템 기본 설정 제거

source: Rename
ko: 이름 바꾸기

source: Reorder same timestamp input events to prioritize modifiers (Default: on)
ko: 모디파이어 키들의 우선 순위를 높이기 위하여 동시 입력 재배열 (기본값: 켜짐)

source: Reset to the default formula
ko: 기본 조합으로 초기화

source: Restart Karabiner-Elements
ko: Karabiner-Elements 재시작

source: Result
ko: 결과

source: Save
ko: 저장

source: Save failed: %@
ko: 저장 실패: %@

source: Search
ko: 검색

source: Show additional menu items (Default: off)
ko: 추가 메뉴 항목 보기 (기본값: 꺼짐)

source: Show icon in menu bar (Default: on)
ko: 메뉴 바에서 아이콘 보기 (기본값: 켜짐)

source: Show profile name in menu bar (Default: off)
ko: 메뉴 바에서 프로필 이름 보기 (기본값: 꺼짐)

source: Simple Modifications
ko: 단순 변형

source: speed:
ko: 속도:

source: States
ko: 상태

# str_configFolderTooltip
source: You can back up your settings or migrate them to another machine by copying karabiner.json. There are also backups under the automatic_backups folder, so you can restore a previous state by overwriting karabiner.json with one of those backups.
ko: karabiner.json 파일을 다른 장치로 복사하여 설정을 백업하거나 인계할 수 있습니다. automatic_backups 폴더에 백업들이 저장되어 있으며, 백업들 중 하나를 karabiner.json 파일에 덮어씌워 이전 상태로 복원할 수 있습니다.

# str_expertModeTooltip
source: Unsafe configuration disables the foolproof feature on the configuration UI. You should not enable unsafe configuration unless you are ready to stop Karabiner-Elements from remote machine. (e.g., using Screen Sharing) Unsafe configuration allows the following items: - Allow you to enable Apple pointing devices in the Devices tab. - Allow you to change left-click in Simple Modifications tab.
ko: 위험한 설정은 설정 UI의 오조작 방지 기능을 비활성화 합니다. Karabiner-Elements를 화면 공유와 같은 원격 기기로 중단시킬 수 있는 경우에 위험한 설정을 켜는 것이 좋습니다. 위험한 설정은 아래 동작들이 가능하도록 합니다: - Apple 포인팅 장치를 장치 탭에서 수정 가능하게 합니다. - 단순 변형 탭에서 좌클릭 동작을 수정 가능하게 합니다.

# str_grabdeviceinsufficientdelaytooltip
source: Setting insufficient delay (e.g., 0) will result in a device becoming unusable after Karabiner-Elements is quit. This is a macOS problem and can be solved by unplugging the device and plugging it again.
ko: 충분하지 않은 지연 시간 (예를 들어, 0)을 설정하면 Karabiner-Elements가 종료된 후 장치를 사용 불가능하게 만들 수 있습니다. 이것은 macOS의 문제이며 장치를 연결 해제 후 다시 연결하는 것으로 해결될 수 있습니다.

# str_karabinerNotificationWinowTooltip
source: What is the Karabiner Notification Window? Karabiner Notification Window is a window that displays messages, located at the bottom right of the screen. It is used for temporary alerts, displaying the status of sticky modifiers, and showing messages for some complex modifications.
ko: Karabiner 알림 창이 무엇인가요? Karabiner 알림 창은 화면 우측 하단에 나타나는 메시지 창입니다. 이 창은 임시 경고, 고정 모디파이어 키 및 복합 변형들에 대한 메시지들을 보여줍니다.

# str_multiTouchExtensionTooltip
source: This setting is hardware-specific. When you import Karabiner-Elements settings to another Mac, the enabled state of the Multitouch Extension is not carried over.
ko: 이 기능은 하드웨어 종속적입니다. Karabiner-Elements 설정을 다른 Mac에서 불러올 때, 활성화된 멀티 터치 확장 사용 설정은 인계되지 않습니다.

# str_sidebarTitleConfigurations
source: Configurations
ko: 설정

# str_sidebarTitleDiagnostic
source: Diagnostic
ko: 진단

# str_sidebarTitleMaintenance
source: Maintenance
ko: 유지보수

# str_sidebarTitleModifications
source: Modifications
ko: 변형

# str_specificDevicesFilterTooltip
source: If this setting is enabled, the following events will be ignored: - Nintendo's Pro Controller (USB connected): - Buttons since on/off events are continuously sent at high frequency even when nothing is pressed. - Sticks since tilt events in random directions are continuously sent even when the stick is not moved at all.
ko: 이 설정이 켜져있으면, 아래 이벤트들은 무시됩니다: - USB로 연결된 Nintendo Switch Pro 컨트롤러: - 아무 버튼도 눌리지 않았음에도 빈번히 발생하는 버튼 꺼짐/켜짐 이벤트 - 스틱이 전혀 움직이지 않았음에도 발생하는 무작위 방향 스틱 기울임 이벤트

# str_systemDefaultConfigurationTooltip
source: You can use Karabiner-Elements even before login by setting the system default configuration. (This operation requires the administrator privilege.
ko: 로그인 이전에도 Karabiner-Elements에서 설정한 내용을 시스템 기본 설정에 적용하여 사용할 수 있습니다. (관리자 권한이 필요합니다.)

# str_titleAllDevice
source: For all devices
ko: 모든 장치용

source: Swap gamepad XY and wheels sticks
ko: 게임패드 XY축과 휠 스틱 전환

source: Swap mouse wheels
ko: 마우스 휠 전환

source: Swap mouse X and Y
ko: 마우스 X축 및 Y축 전환

source: System default configuration
ko: 시스템 기본 설정

source: System default configuration is not set.
ko: 시스템 기본 설정으로 설정되어 있지 않습니다.

source: System Extensions
ko: 시스템 확장 프로그램

source: The background services are not enabled. Please enable them.
ko: 백그라운드 서비스들이 꺼져 있습니다. 서비스들을 켜십시오.

source: The background services are not running. Please wait a few seconds.
ko: 백그라운드 서비스들이 동작중이지 않습니다. 잠시 기다려 주십시오.

source: The current virtual keyboard and mouse driver is outdated.
ko: 가상 키보드 및 마우스 드라이버 버전이 이전 버전입니다.

source: The keyboard type selected here will be used in Karabiner-Elements, regardless of the physical keyboard you're using.
ko: 선택된 키보드 종류는 실제 사용하는 키보드 종류와 관계 없이 Karabiner-Elements에서 사용됩니다.

source: The unsafe configuration is enabled, so the foolproof feature is currently inactive.
ko: 위험한 설정이 켜져 있습니다. 오조작 방지 기능이 현재 비활성화되어 있습니다.

source: The virtual keyboard and mouse driver is not loaded.
ko: 가상 키보드 및 마우스 드라이버가 로딩되지 않음.

source: There are %llu other settings for devices that are not currently connected
ko: 현재 접속되지 않은 장치들을 위한 %llu개의 다른 설정들이 있습니다.

source: This window is pinned after opening in an external editor
ko: 외부 편집기

source: Treat as a built-in keyboard
ko: 내장 키보드로 취급

source: Uninstall
ko: 삭제

source: Update
ko: 업데이트

source: Use all F1, F2, etc. keys as standard function keys:
ko: F1, F2 및 기타 키들을 기본 기능 키로 사용하기:

source: Virtual Keyboard
ko: 가상 키보드

source: Waiting for a connection from Karabiner-Core-Service to Karabiner-VirtualHIDDevice-Daemon
ko: Karabiner-Core-Service가 Karabiner-VirtualHIDDevice-Daemon에 접속하는 것을 대기중

source: Waiting for a connection to the IOKit service
ko: IOKit 서비스로 접속 대기중

source: Waiting for the background services to start for %lld seconds.
ko: 백그라운드 서비스가 시작될 때 까지 %lld초 동안 대기중

source: Web sites
ko: 웹 사이트

source: Wheels multiplier:
ko: 휠 배수:

source: Wheels stick
ko: 휠 스틱

source: XY movement multiplier:
ko: XY축 이동 배수:

source: XY stick
ko: XY 스틱

source: You can reorder list by dragging
ko: 순서 변경:

source: You need to permit the background services to use Karabiner-Elements.
ko: Karabiner-Elements를 사용하기 위한 백그라운드 서비스 허용이 필요합니다.
